{
  "jlpt3": {
    "n3_102": {
      "hint": "少し... / ちょっと...（否定的な意味合い）",
      "description": "この構文は、誰かや何かが少し傾向がある、または特定の状態の兆候を示していることを表現するために使用されます。通常は否定的な意味で使われます。それは、何かが少し...のように感じたり、特定の状態にわずかに傾いていることを示します。感情、状況、または状態を説明するためにしばしば使用されます。"
    },
    "n3_103": {
      "hint": "全く...ない / 絶対に...ない",
      "description": "この構文は、提案や非難に対する返答として、何かを強く否定したり拒否したりするために使われます。否定に強調を加え、その行動が起こっていない、または一度も起こらなかったことを意味し、防御的または憤慨したトーンを含みます。「なんか」は軽蔑的なニュアンスを加え、否定をさらに強調します。"
    },
    "n3_104": {
      "hint": "全く...ない / 絶対に...ない",
      "description": "これらの構文は、防御的、軽蔑的、または憤慨したトーンで何かを強く否定または拒否するために使用されます。「なんか」は否定に感情的または軽蔑的なニュアンスを加え、拒絶をさらに強調します。非難、仮定、または提案を反論するために頻繁に使用され、その行動、状態、または状況が全く正しくないことを強調します。"
    },
    "n3_105": {
      "hint": "さえ / ～さえすれば",
      "description": "これらの構文は、何かが起こるために必要な最小の条件を強調するために使用されます。「N＋[助詞]＋さえ」は名詞と一緒に使用され、最も予想外のことさえ含まれていることを表現します。「Vて＋さえ」は、特定の行動を行えば、期待される結果が続くことを示します。強調されるのは、それが唯一または最も重要な条件であるということです。"
    },
    "n3_106": {
      "hint": "さえ / ～さえすれば",
      "description": "これらの構文は、極端な例を挙げることで何かを強調するために使用されます。「N＋[助詞]＋さえ」は、極端または予想外の例でさえも真実であることを強調するために使用され、「Vて＋さえ」は、特定の行動を行えば結果が続くことを示します。この表現は、最小の条件ですら不十分であることを強調するために、しばしば否定形と一緒に使用されます。"
    },
    "n3_107": {
      "hint": "～ほど / ～くらい",
      "description": "この構文は、何かの程度や度合いを表現するために使用されます。それは、何かが起こる程度にあることを暗示し、状況や状態を比較するために使用できます。誇張や大まかな状態を説明するために頻繁に使用されます。文脈によっては、何かを軽視したり、些細なものとして扱ったりするためにも使用されます。"
    },
    "n3_108": {
      "hint": "～まま / ～ままで",
      "description": "この構文は、ある行動が特定の状態に放置されたことを表現するために使用され、通常は怠慢や無責任を暗示します。それは、何かが完了または対処されるべきだったが、不完全または無秩序の状態で放置されたことを示唆します。また、行動が止まることなく続くことを表現するためにも使用されます。"
    },
    "n3_109": {
      "hint": "だらけ / ～だらけ",
      "description": "この構文は、何かがいっぱいであること、または何かで覆われていることを表現するために使用され、しばしば否定的な意味合いがあります。望ましくない、または不快なものが過剰に存在することを暗示します。「だらけ」は、不快なものが大量に存在する状況を説明するために通常使用されます。"
    },
    "n3_110": {
      "hint": "かも / もしかして / 優しく提案する",
      "description": "この構文は、誰かの外見や行動が通常と異なることを軽く指摘する場合や、穏やかに指示や提案をする場合に使用されます。あまり強引に聞こえないように、柔らかくまたは間接的に使用されることがよくあります。トーンは通常カジュアルで、日常会話で頻繁に使用されます。"
    },
    "n3_111": {
      "hint": "～っぽい / ～らしい",
      "description": "この構文は、何かまたは誰かが特定のカテゴリやグループの典型的な特性を持っていることを表現するために使用されます。また、話し手が聞いたり観察したことに基づいて、何かが真実であるように見える場合にも使用されますが、これは確認されていません。それは、典型性の感覚と噂や推測の感覚の両方を伝えます。"
    }
  }
}